Revit 2027 API
AnalysisDisplayStyle.HasVectorSettings Method
 If true style has vector settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasVectorSettings()
Public Function HasVectorSettings As Boolean
public:
bool HasVectorSettings()
member HasVectorSettings : unit -> bool
Return Value
Boolean
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace